fixture/vcr_cassettes/valid_invalid.json

[
  {
    "request": {
      "body": "<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:urn=\"urn:ec.europa.eu:taxud:vies:services:checkVat:types\">\n        <soapenv:Header/>\n        <soapenv:Body>\n          <urn:checkVat>\n            <urn:countryCode>NL</urn:countryCode>\n            <urn:vatNumber>9999999</urn:vatNumber>\n          </urn:checkVat>\n        </soapenv:Body>\n      </soapenv:Envelope>",
      "headers": {
        "SOAPAction": "",
        "Content-Type": "text/xml;charset=UTF-8"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "http://ec.europa.eu/taxation_customs/vies/services/checkVatService"
    },
    "response": {
      "binary": false,
      "body": "<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\"><soap:Body><checkVatResponse xmlns=\"urn:ec.europa.eu:taxud:vies:services:checkVat:types\"><countryCode>NL</countryCode><vatNumber>9999999</vatNumber><requestDate>2022-01-10+01:00</requestDate><valid>false</valid><name>---</name><address>---</address></checkVatResponse></soap:Body></soap:Envelope>",
      "headers": {
        "Date": "Mon, 10 Jan 2022 14:10:37 GMT",
        "Transfer-Encoding": "chunked",
        "Content-Type": "text/xml; charset=UTF-8",
        "Server": "Europa",
        "Proxy-Connection": "Keep-Alive",
        "Connection": "Keep-Alive"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]